Repository: cjlester41/pixdecor
Catalog: locale/*/LC_MESSAGES/wf-plugin-pixdecor.po
Languages: ro_ro

source: Pix Decoration
ro_ro: Decorație Pix

source: A highly configurable and optionally fancy decorator plugin for wayfire.
ro_ro: Un decorator foarte configurabil și opțional extravagant pentru wayfire.

source: General
ro_ro: Generale

source: Border size
ro_ro: Dimensiunea bordurii

source: Sets the border size in pixels.
ro_ro: Stabilește dimensiunea bordurii în pixeli.

source: When to render the titlebar
ro_ro: Când să se deseneze bara de titlu

source: When to render a titlebar with title text and buttons.
ro_ro: Când să se deseneze o bară de titlu cu textul titlului și butoanele.

source: Always
ro_ro: Întotdeauna

source: Only When Windowed
ro_ro: Doar când este nemaximizată

source: Only When Maximized
ro_ro: Doar când este maximizată

source: Never
ro_ro: Niciodată

source: Draw borders on maximized windows
ro_ro: Desenează borduri pe ferestrele maximizate

source: Whether or not to render side and bottom decorations on maximized windows.
ro_ro: Dacă să se deseneze decorațiile laterale și de jos pe ferestrele maximizate sau nu.

source: Draw shadows on maximized windows
ro_ro: Desenează umbre pe ferestrele maximizate

source: Whether or not to allocate space for shadows on maximized windows.
ro_ro: Dacă să se aloce spațiu pentru umbre pe ferestrele maximizate sau nu.

source: Decoration disabled for specified window types
ro_ro: Decorarea dezactivată pentru tipurile specificate de ferestre

source: Disables window decoration for windows matching the specified criteria.
ro_ro: Dezactivează decorarea ferestrelor care îndeplinesc criteriile specificate.

source: Decoration applied for specified window types
ro_ro: Decorarea aplicată pentru tipurile specificate de ferestre

source: Forces window decoration for windows matching the specified criteria.
ro_ro: Forțează decorarea ferestrelor care îndeplinesc criteriile specificate.

source: Title Font
ro_ro: Fontul titlului

source: Font to use for the titlebar. The font size determines the titlebar height.
ro_ro: Fontul de folosit pentru bara de titlu. Dimensiunea fontului determină înălțimea barei de titlu.

source: Color when focused
ro_ro: Culoare când este focalizată

source: Color of the window border when it has focus.
ro_ro: Culoarea marginii ferestrei când aceasta deține focalizarea.

source: Color when not focused
ro_ro: Culoare când nu este focalizată

source: Color of the window border when it does not have focus.
ro_ro: Culoarea marginii ferestrei când aceasta nu deține focalizarea.

source: Text color when focused
ro_ro: Culoarea textului când este focalizată

source: Color of the window titlebar text when it has focus.
ro_ro: Culoarea textului titlului ferestrei când aceasta deține focalizarea.

source: Text color when not focused
ro_ro: Culoarea textului când nu este focalizată

source: Color of the window titlebar text when it does not have focus.
ro_ro: Culoarea textului titlului ferestrei când aceasta nu deține focalizarea.

source: Titlebar Text Alignment
ro_ro: Alinierea textului titlului

source: Sets the alignment of the titlebar text.
ro_ro: Stabilește alinierea textului barei de titlu.

source: Left
ro_ro: Stânga

source: Center
ro_ro: Centru

source: Right
ro_ro: Dreapta

source: Overlay Engine
ro_ro: Motor de suprapunere

source: Sets the overlay engine.
ro_ro: Alege motorul de suprapunere.

source: None
ro_ro: Niciuna

source: Rounded Corners
ro_ro: Colțuri rotunjite

source: Beveled Glass
ro_ro: Sticlă teșită

source: Effect Type
ro_ro: Tipul efectului

source: Sets the effect type.
ro_ro: Stabilește tipul efectului.

source: Smoke
ro_ro: Fum

source: Ink
ro_ro: Cerneală

source: Clouds
ro_ro: Nori

source: Halftone
ro_ro: Semitonuri

source: Pattern
ro_ro: Model

source: Lava
ro_ro: Lavă

source: Hex
ro_ro: Hexagonal

source: Zebra
ro_ro: Zebră

source: Neural network
ro_ro: Rețea neuronală

source: Hexagon maze
ro_ro: Labirint hexagonal

source: Raymarched truchet
ro_ro: Truchetă cu simularea luminii

source: Neon pattern
ro_ro: Model neon

source: Neon rings
ro_ro: Inele neon

source: Deco
ro_ro: Decorativ

source: Effect Color
ro_ro: Culoarea efectului

source: Color of the titlebar background effect.
ro_ro: Culoarea efectului fundalului barei de titlu.

source: Animate Effects
ro_ro: Animare efecte

source: WARNING: Enabling this option can use lots of system resources. Enables animating and constant repainting of window decorations.
ro_ro: AVERTISMENT: Activarea acestei opțiuni poate folosi foarte multe resurse ale sistemului. Activează animarea și redesenarea constantă a decorațiilor de fereastră.

source: Rounded Corner Radius
ro_ro: Raza colțurilor rotunjite

source: The radius for corners.
ro_ro: Raza de folosit pentru colțuri.

source: Shadow Radius
ro_ro: Raza umbrei

source: The radius for shadows.
ro_ro: Raza de folosit pentru umbre.

source: Shadow Color
ro_ro: Culoarea umbrei

source: Color of the drop shadows.
ro_ro: Culoarea umbrelor.

source: Buttons
ro_ro: Butoane

source: Button Layout
ro_ro: Aranjament butoane

source: The layout of the 'minimize', 'maximize' and 'close' buttons. Use a comma to separate button strings and a colon to denote the seperation between left and right buttons.
ro_ro: Aranjamentul butoanelor „minimize” (minimizare), „maximize” (maximizare) și „close” (închidere). Folosiți câte o virgulă pentru a separa numele butoanelor și două puncte (:) pentru a marca separarea dintre butoanele de pe stânga și cele de pe dreapta.

source: Button Color
ro_ro: Culoarea butoanelor

source: Color of the minimize, maximize and close buttons.
ro_ro: Culoarea butoanelor de minimizare, maximizare și închidere.

source: Button Line Thickness
ro_ro: Grosimea liniei butoanelor

source: The thickness used to draw the minimize, maximize and close button lines.
ro_ro: Grosimea folosită pentru a desena liniile butoanelor de minimizare, maximizare și închidere.

source: Left Button Spacing
ro_ro: Spațierea butoanelor din stânga

source: The space between each button on the left.
ro_ro: Spațiul adăugat între butoanele de pe stânga.

source: Right Button Spacing
ro_ro: Spațierea butoanelor din dreapta

source: The space between each button on the right.
ro_ro: Spațiul adăugat între butoanele de pe dreapta.

source: Left Button X Offset
ro_ro: Deviație pe X pentru butoanele din stânga

source: Use this option to move the buttons on the left to the left or right.
ro_ro: Folosiți această opțiune pentru a muta butoanele de pe stânga mai la stânga sau mai la dreapta.

source: Right Button X Offset
ro_ro: Deviație pe X pentru butoanele din dreapta

source: Use this option to move the buttons on the right to the left or right.
ro_ro: Folosiți această opțiune pentru a muta butoanele de pe dreapta mai la stânga sau mai la dreapta.

source: Button Y Offset
ro_ro: Poziția pe Y a butoanelor

source: Use this option to move buttons up or down.
ro_ro: Folosiți această opțiune pentru a muta butoanele mai sus sau mai jos.

source: Button Hover Animation Duration
ro_ro: Durata animației de planare pe butoane

source: The time the hover animation will last, in milliseconds.
ro_ro: Timpul în milisecunde pe care îl va dura animația când se planează pe butoane.

source: Button Minimize Image
ro_ro: Imaginea butonului de minimizare

source: The png image to use for the minimize button.
ro_ro: Imaginea PNG care să fie folosită pentru butonul de minimizare.

source: Button Maximize Image
ro_ro: Imaginea butonului de maximizare

source: The png image to use for the maximize button.
ro_ro: Imaginea PNG care să fie folosită pentru butonul de maximizare.

source: Button Restore Image
ro_ro: Imaginea butonului de

source: The png image to use for the restore button.
ro_ro: Imaginea PNG care să fie folosită pentru butonul de restaurare (demaximizare).

source: Button Close Image
ro_ro: Imaginea butonului de închidere

source: The png image to use for the close button.
ro_ro: Imaginea PNG care să fie folosită pentru butonul de închidere.

source: Button Minimize Hover Image
ro_ro: Imaginea butonului de minimizare la planare

source: The png image to use when hovering the minimize button.
ro_ro: Imaginea PNG care să fie folosită când se planează peste butonul de minimizare.

source: Button Maximize Hover Image
ro_ro: Imaginea butonului de maximizare la planare

source: The png image to use when hovering the maximize button.
ro_ro: Imaginea PNG care să fie folosită când se planează peste butonul de maximizare.

source: Button Restore Hover Image
ro_ro: Imaginea butonului de restaurare la planare

source: The png image to use when hovering the restore button.
ro_ro: Imaginea PNG care să fie folosită când se planează peste butonul de restaurare (demaximizare).

source: Button Close Hover Image
ro_ro: Imaginea butonului de închidere la planare

source: The png image to use when hovering the close button.
ro_ro: Imaginea PNG care să fie folosită când se planează peste butonul de închidere.

source: Shade
ro_ro: Restrângere

source: Enable Shade Effect
ro_ro: Activează efectul de restrângere

source: Use the axis binding or scroll on the titlebar of pixdecor windows to shade windows into their respective titlebars.
ro_ro: Folosiți asocierea de axă sau derulați pe bara de titlu a ferestrelor decorate de pixdecor pentru a le restrânge în barele de titlu respective.

source: Shade Duration
ro_ro: Durata restrângerii

source: The duration of the shade animation in milliseconds.
ro_ro: Durata animației de restrângere, în milisecunde.

source: Shade Modifier
ro_ro: Modificator de restrângere

source: When the shade modifier key is held down, you can scroll down and up to shade and unshade the window.
ro_ro: Când tasta modificator pentru restrângere este apăsată, puteți derula în jos și în sus pentru a restrânge fereastra sau a o readuce la starea inițială.

source: Toggle Window Shade
ro_ro: Comutare restrângere fereastră

source: Toggles shade for the active window.
ro_ro: Comută restrângerea ferestrei active.

source: CSD Titlebar Height
ro_ro: Înălțimea barei de titlu CSD

source: Because there is no way to know the client surface titlebar height, this is an option to adjust it.
ro_ro: Pentru că nu se poate ști dimensiunea barei de titlu furnizată de client, această opțiune o poate regla.
